vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32H7RSxx_DFP.pdsc
          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");                                                  // Call SWO Trace Setup
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");                                                 // Call TPIU Trace Setup
            </block>
          </control>
        </sequence>

        <sequence name="TraceStop">
          <block>
            // Nothing required for SWO Trace
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                               // SWO enabled?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                               // Synchronous trace port enabled?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("DisableTraceSWO");
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("DisableTraceTPIU");
            </block>
          </control>
        </sequence>

        <!-- User-Defined Sequences -->
        <sequence name="CheckID">
          <block>
            __var pidr1 = 0;
            __var pidr2 = 0;
            __var jep106id = 0;
            __var ROMTableBase = 0;

            __ap = 0;      // System debug access port (APB-AP)

            ROMTableBase = ReadAP(0xF8) &amp; ~0x3;

            pidr1 = Read32(ROMTableBase + 0x0FE4);
            pidr2 = Read32(ROMTableBase + 0x0FE8);
            jep106id = ((pidr2 &amp; 0x7) &lt;&lt; 4 ) | ((pidr1 &gt;&gt; 4) &amp; 0xF);
          </block>

          <control if="jep106id != 0x20">
            <block>
              Query(0, "Not a genuine ST Device! Abort connection", 1);
              Message(2, "Not a genuine ST Device! Abort connection.");
            </block>
          </control>
        </sequence>

        <sequence name="EnableTraceSWO">
          <block>
            __var value = 0;

            Sequence("ConfigureTraceSWOPin");

            __ap   = 0;                                                                    // Switch to System Debug Access Port

            // Enable Trace Clock
            // not necessary because already done in "DebugDeviceUnlock".

//          // Configure SWO Funnel (SWTF) at 0xE00E4000
//          value      =  Read32(0xE00E4000);                                              // Read Trace Funnel CONTROL Register
//          value &amp;=  0x00000F00;                                                      // Preserve Hold Time Settings,
//          value     |=  0x00000001;                                                      // Enable ITM slave ports
//          Write32(0xE00E4000, value);                                                    // Update Trace Funnel CONTROL Register
          </block>
        </sequence>

        <sequence name="DisableTraceSWO">
          <block>
            __var value = 0;

            __ap   = 0;                                                                    // Switch to System Debug Access Port

            // Disable Trace Clock
            value      =  Read32(0xE00E1004);                                              // Read DBGMCU_CR
            value &amp;= ~0x00100000;                                                      // DBGMCU_CR[20] : set TraceClkEn
            Write32(0xE00E1004, value);                                                    // Update DBGMCU_CR

//          // Configure SWO Funnel (SWTF) at 0xE00E4000
//          value      =  Read32(0xE00E4000);                                              // Read Trace Funnel CONTROL Register
//          value &amp;=  0x00000F00;                                                      // Preserve Hold Time Settings, disable active slave ports
//          Write32(0xE00E4000, value);                                                    // Update Trace Funnel CONTROL Register
          </block>
        </sequence>

        <sequence name="EnableTraceTPIU">
          <block>
            __var value = 0;

            Sequence("ConfigureTraceTPIUPins");

            __ap   = 0;                                                                    // Switch to System Debug Access Port

            // Enable Trace Clock
            // not necessary because already done in "DebugDeviceUnlock".

//          // Configure CoreSight Trace Funnel (CSTF) at 0xE00F3000
//          value      =  Read32(0xE00F3000);                                              // Read Trace Funnel CONTROL Register
//          value &amp;=  0x00000F00;                                                      // Preserve Hold Time Settings
//          value     |=  0x00000003;                                                      // Enable ITM and ETM slave ports
//          Write32(0xE00F3000, value);                                                    // Update Trace Funnel CONTROL Register
          </block>
        </sequence>

        <sequence name="DisableTraceTPIU">
          <block>
            __var value = 0;

            __ap   = 0;                                                                    // Switch to System Debug Access Port

            // Disable Trace Clock
            value      =  Read32(0xE00E1004);                                              // Read DBGMCU_CR
            value &amp;= ~0x00100000;                                                      // DBGMCU_CR[20] : set TraceClkEn
            Write32(0xE00E1004, value);                                                    // Update DBGMCU_CR

//          // Configure CoreSight Trace Funnel (CSTF) at 0xE00F3000
//          value      =  Read32(0xE00F3000);                                              // Read Trace Funnel CONTROL Register
//          value &amp;=  0x00000FFC;                                                      // Preserve Hold Time Settings and other possibly set slave ports
//          Write32(0xE00F3000, value);                                                    // Update Trace Funnel CONTROL Register
          </block>
        </sequence>

        <sequence name="ConfigureTraceSWOPin">
          <block>
            __var pin     = 0;
            __var port    = 0;
            __var portAdr = 0;
            __var pos     = 0;

            __var SWO_Pin = 0x00010003;          // PB3
          </block>

            <!-- configure SWO -->
            <block info="configure SWO">
              pin     =               ((SWO_Pin            ) &amp; 0x0000FFFF);
              port    =               ((SWO_Pin &gt;&gt; 16) &amp; 0x0000FFFF);
              portAdr = 0x58020000 + (((SWO_Pin &gt;&gt; 16) &amp; 0x0000FFFF) * 0x400);

              pos = pin * 2;
              Write32(0x58024540,     ((Read32(0x58024540    )                         ) | (1 &lt;&lt; port)) );  // RCC_AHB4ENR:   IO port clock enable
              Write32(portAdr + 0x00, ((Read32(portAdr + 0x00) &amp; ~( 3 &lt;&lt; pos)) | (2 &lt;&lt; pos )) );  // GPIOx_MODER:   Set Mode (Alternate Function)
              Write32(portAdr + 0x08, ((Read32(portAdr + 0x08)                         ) | (3 &lt;&lt; pos )) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
              Write32(portAdr + 0x0C, ((Read32(portAdr + 0x0C) &amp; ~( 3 &lt;&lt; pos))                    ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
            </block>
            <control if="pin &lt;  8">
              <block>
              pos = ((pin    ) &amp; 7) * 4;
              Write32(portAdr + 0x20, ((Read32(portAdr + 0x20) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="pin &gt;= 8">
              <block>
              pos = ((pin - 8) &amp; 7) * 4;
              Write32(portAdr + 0x24, ((Read32(portAdr + 0x24) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRH:    Alternate Function to AF0
              </block>
            </control>
        </sequence>

        <sequence name="ConfigureTraceTPIUPins">
          <block>
            __var pin     = 8;
            __var port    = 0;
            __var portAdr = 0;
            __var pos     = 0;

