vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32H7RSxx_DFP.pdsc
          <feature type="BGA" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H7R7A8Ix  ***************************** -->
        <device Dname="STM32H7R7A8Ix">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="169"/>
        </device>

        <!-- *************************  Device 'STM32H7R7I8Kx  ***************************** -->
        <device Dname="STM32H7R7I8Kx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H7R7L8Hx  ***************************** -->
        <device Dname="STM32H7R7L8Hx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="225"/>
        </device>

        <!-- *************************  Device 'STM32H7R7L8HxH  **************************** -->
        <device Dname="STM32H7R7L8HxH">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="225"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32H7S7'  **************************** -->
      <subFamily DsubFamily="STM32H7S7">
        <debug __ap="1" svd="CMSIS/SVD/STM32H7S.svd"/>
        <compile define="STM32H7S7xx"/>

        <book name="https://www.st.com/resource/en/datasheet/stm32h7s3a8.pdf" title="STM32H7S3x8 STM32H7S7x8 Datasheet"/>

        <!-- default memory configuration.
             Optionbyte settings: FLASH_OBW2SR.ECC_ON_SRAM = 0
                                  FLASH_OBW2SR.DTCM_AXI_SHARE = 0 
                                  FLASH_OBW2SR.ITCM_AXI_SHARE = 0      -->
        <memory name="ITCM_RAM"   access="rwx" start="0x00000000" size="0x00010000" init="0" default="0" />
        <memory name="DTCM_RAM"   access="rwx" start="0x20000000" size="0x00010000" init="0" default="1" />
        <memory name="AXI_SRAM"   access="rwx" start="0x24000000" size="0x00072000" init="0" default="1" />
        <memory name="AHB_SRAM"   access="rwx" start="0x30000000" size="0x00008000" init="0" default="1" />
        <memory name="BKP_SRAM"   access="rwx" start="0x38800000" size="0x00001000" init="0" default="0" />

        <!-- ################################### 64 KB ################################## -->
        <!-- *************************  Device 'STM32H7S7I8Tx  ***************************** -->
        <device Dname="STM32H7S7I8Tx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H7S7Z8Jx  ***************************** -->
        <device Dname="STM32H7S7Z8Jx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H7S7A8Ix  ***************************** -->
        <device Dname="STM32H7S7A8Ix">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="169"/>
        </device>

        <!-- *************************  Device 'STM32H7S7I8Kx  ***************************** -->
        <device Dname="STM32H7S7I8Kx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H7S7L8Hx  ***************************** -->
        <device Dname="STM32H7S7L8Hx">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="225"/>
        </device>

        <!-- *************************  Device 'STM32H7S7L8HxH  **************************** -->
        <device Dname="STM32H7S7L8HxH">
          <memory name="Flash" access="rx"                start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32H7Rx_64k.FLM" start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00010000" default="1" />

          <feature type="BGA" n="225"/>
        </device>

      </subFamily>

    </family>

  </devices>

  <conditions>
    <!-- Device Conditions -->
    <condition id="STM32H7RS">
      <description>STMicroelectronics STM32H7RS Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H7[RS]*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32H7RS CMSIS">
      <description>STMicroelectronics STM32H7RS Device and CMSIS-CORE</description>
      <require condition="STM32H7RS"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>
    <!-- CubeMX Generator -->
    <component generator="CubeMX" Cclass="Device" Cgroup="CubeMX" Cversion="1.0.0" condition="STM32H7RS CMSIS">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_CUBE_MX
        #define CMSIS_device_header "stm32h7rsxx.h"
      </RTE_Components_h>
      <files>
        <file category="doc" name="https://open-cmsis-pack.github.io/cmsis-toolbox/CubeMX"/>
      </files>
    </component>
  </components>

  <csolution>
    <!-- CubeMX Basic CMSIS Solution template -->
    <template name="CubeMX Basic solution" path="Templates/CubeMX" file="CubeMX.csolution.yml" condition="STM32H7RS">
      <description>Create a CubeMX basic solution with project</description>
    </template>
  </csolution>
</package>
